# Until Vim is compiled with X support by default in the homebrew/core repo I'm
# staying with a custom tap (that also strips out Python, Ruby, Lua etc
# support).
tap "jcla1/custom-vim-tap"
brew "jcla1/custom-vim-tap/vim"

brew "bazel"
brew "fzf"
brew "gcc"
brew "htop"
brew "llvm"
brew "node"
brew "r"
brew "ripgrep"
brew "tree"
brew "zola"

# LSP servers and the like
brew "shellcheck"
brew "shfmt"
brew "texlab"
brew "vint"

